app/views/team/gossip.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
            <%= link_to("/author/#{@gossip_searched.user_id}") do %>
              <%=@gossip_searched.user.first_name %> <%=@gossip_searched.user.last_name %>