app/views/team/home.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <%= link_to("/gossip/#{i+1}") do %>
            <%= gossip.user.first_name %> : </br> <%= gossip.content %> </p>