app/controllers/team_controller.rb

    def home
        @list_gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

 def gossip
    @gossip_searched = Gossip.find(params[:gossip_number])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def author
    @author_searched = User.find(params[:author_info])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]